<?php

namespace RA7\Framework\System\Exception;

/**
 * Список доступних ініціаторів винятків.
 * Під 'ініціатор' мається на увазі - місце або компонент, звідки буде викидатись такий виняток.
 * Для правильної роботи, а також кращої сумісності між модулями фреймворка та додатків на його основі,
 * рекомендується дотримуватись опису кожного типу винятку та місця звідки його можна викидати,
 * віддаючи перевагу детальнішому варіанту ніж узагальненому!
 *
 * @author Ruslan_A7 (RA7) <https://ra7.iuid.cc>
 * Код може містити деякі частини, що були створені за допомогою ChatGPT.
 * @license RA7 Open Free License
 * @github <https://github.com/Ruslan-A7>
 */
enum ExceptionInitiatorsEnum {

    /** Для узагальненого винятку, що викидає додаток, будь-який його модуль, розширення та віджет */
    case App;

    /** Для винятку, що викидає будь-яке розширення додатка */
    case App_Extension;

    /** Для винятку, що викидає будь-який модуль додатка */
    case App_Module;

    /** Для винятку, що викидає будь-який віджет додатка */
    case App_Widget;

    /** Для винятку, що викидає кеш */
    case Cache;

    /** Для винятку, що викидає конфігурація фреймворка та його частини */
    case Config;

    /** Для винятку, що викидає будь-який контейнер */
    case Container;

    /** Для винятку, що викидає база даних та DatabaseManager */
    case Database;

    /** Для винятку, що викидає файлова система */
    case Filesystem;

    /** Для узагальненого винятку, що викидає фреймворк (будь-яка його частина, що немає окремого варіанта в цьому списку) */
    case Framework;

    /** Для винятку, що викидає компонент для отримання http-запиту, формування і відправки http-відповіді */
    case HTTP;

    /** Для винятку, що викидає локалізація (наприклад: мова, перекладач, локація та інші) */
    case Localization;

    /** Для винятку, що викидає будь-який компонент, що відповідає за рендер (окрім компонентів шаблонізатора Templosaur) */
    case Rendering;

    /** Для винятку, що викидає система маршрутизації */
    case Routing;

    /** Для винятку, що викидає будь-який компонент системи безпеки */
    case Security;

    /** Для винятку, що викидає налаштування додатка та користувацькі налаштування */
    case Settings;

    /** Для винятку, що викидає будь-яке компонент для обробки сховища даних (наприклад: Session, Cookie, LocalStorage), що немає окремого варіанта в цьому списку */
    case Storage;

    /** Для винятку, що викидає шаблонізатор Templosaur */
    case Templosaur;

    /** Для винятку, що викидається для тестування */
    case Test;

}