<?php

namespace RA7\Framework\System\Exception;

/**
 * Список доступних типів винятків.
 *
 * В залежності від конфігурації обробка кожного типу винятку може відрізнятися.
 *
 * @author Ruslan_A7 (RA7) <https://ra7.iuid.cc>
 * Код може містити деякі частини, що були створені за допомогою ChatGPT.
 * @license RA7 Open Free License
 * @github <https://github.com/Ruslan-A7>
 */
enum ExceptionTypesEnum {

    /** Трапилась виняткова ситуація */
    case Exception;

    /** Трапилась фатальна помилка без можливості обробки */
    case Error;

    /** Трапилась критична помилка але її можна обробити */
    case RecoverableError;

    /** Попередження */
    case Warning;

    /** Сповіщення */
    case Notice;

    /** Сповіщення про застарілий функціонал */
    case Deprecated;

    /** Сповіщення про експериментальний функціонал */
    case Experimental;

    /**
     * Тільки для розробника - призначено для винятків не доступних користувачам, а лише розробникам
     * (наприклад, для збереження певної інформації в лог без сповіщення користувачу)
     */
    case DevOnly;

}