<?php

namespace RA7\Framework\System\Exception;

/**
 * Інтерфейс повідомлення винятку з його назвою та описом.
 *
 * Назву винятку можна використовувати для типізації винятків - наприклад: 'Файл не знайдено', 'В доступі відмовлено', 'Недоступний тип' і т.д.
 * Опис винятку призначений для тексту, що зазвичай пишуть в $message винятку.
 * Також можна додати посилання на документацію до винятку.
 *
 * Якщо опис винятку не задати, то метод getMessage() верне назву винятку (навіть якщо це пустий рядок).
 *
 * @author Ruslan_A7 (RA7) <https://ra7.iuid.cc>
 * Код може містити деякі частини, що були створені за допомогою ChatGPT.
 * @license RA7 Open Free License
 * @github <https://github.com/Ruslan-A7>
 */
interface ExceptionMessageInterface {

    /** Назва винятку */
    public string $name {get;}

    /** Опис винятку */
    public string $description {get;}

    /** Посилання на документацію до винятку */
    public string $link {get;}



    /**
     * Створити повідомлення з назвою та описом винятку.
     *
     * @param string $name назва винятку (можна використовувати для типізації винятків - наприклад: 'Файл не знайдено', 'В доступі відмовлено', 'Недоступний тип' і т.д.)
     * @param string $description опис винятку (текст, що зазвичай пишуть в $message винятку)
     * @param string $link посилання на документацію до винятку
     */
    public function __construct(string $name = '', string $description = '', string $link = '');



    /** Отримати повідомлення винятку (якщо опис винятку відсутній вертає його назву, а якщо є назва та опис вертає обох розділяючи їх перенесенням рядка) */
    public function getMessage(): string;

}